SCHEDULE_CORRECTION_PROMPT_TEMPLATE = r"""Я надам тобі розклад пар у вищому навчальному закладі. Відкорегуй його згідно з наступних правил:
* Не чіпай наступні поля: index, label, isBiweekly, week
* Аудиторія (room) це зазвичай буква з числом. Наприклад: "а.235", "К.14а"
* Викладач записується без кваліфікації. Наприклад: "Петрів|Тимченко"
* Ось декілька можливих кваліфікацій: доц., ст. викл., проф., ст. в., викл., ст.пр., пр., ст. ас., ас.
* Декілька аудиторій (room) записуються через цей символ: "|". Наприклад: "а.235|а.122|а.111"
* Декілька викладачів (teacher) записуються через цей символ: "|". Наприклад: "Петрів|Тимченко"
* Декілька кваліфікацій (qualifications) записуються через цей символ: "|". Наприклад: "ст. в.|ст. в.|доц."
* Не видаляй абревіації типу "ДВВ" з поля "name".
* Кількість полей повинна залишитись незмінною. Не видаляй/додавай поля.


Твоє основне завдання: відформатувати поля "name", перенести аудиторії (room) та викладачів (teacher) з поля "name" у їх власні поля.
Якщо поля room, teacher вже правильно заповнені, то просто видали цю інформацію з поля "name".


Ось сам розклад у форматі JSON. Текст відповіді повинен містити буквально лише JSON об'єкт й нічого іншого:
<{}>
"""
